HarrydeBug/WSPR-transmitters/Standard Firmware/Release/Hardware_Version_1_ATMega328/WSPR-TX0.69/WSPR-TX0.69.ino
void DoWSPR ()
{
  // static double Lat;
  // static double Lon;
  PowerSaveOFF();  //Make sure GPS is not in sleep mode
  CurrentMode = WSPRBeacon;
  if (NoBandEnabled ()) {
    Serial.println (F("{MIN} Warning, configuration error, tranmission is not enabled on any band!"));
  }
  else
  {
    NextFreq();
    freq = freq + (100ULL * random (-100, 100)); //modify TX frequency with a random value beween -100 and +100 Hz
    si5351aOutputOff(SI_CLK0_CONTROL);
    SendAPIUpdate (UMesCurrentMode);

    //LOOP HERE FOREVER OR UNTIL INTERRUPTED BY A SERIAL COMMAND
    while (!Serial.available()) { //Do until incoming serial command
      while (GPSSerial.available()) {
        if (Serial.available()) {// If serialdata was received on control port then abort and handle command
          DoIdle(); //Return to ideling
          return;
        }
        gps.encode(GPSSerial.read());
        if (gps.location.isUpdated())
        {
          GPSH = gps.time.hour();
          GPSM = gps.time.minute();
          GPSS = gps.time.second();

          //Lat = gps.location.lat();
          //Lon = gps.location.lng();

          if (GadgetData.WSPRData.LocatorOption == GPS) { //If GPS should update the Maidenhead locator
            //calcLocator (Lat, Lon);
            calcLocator (gps.location.lat(), gps.location.lng());
            //Serial.print (F("GPS calculated Maidenhead locator is "));
          }
          else
          {
            // Serial.print (F("Maidenhead locator manually set to "));
          }
          // if (SetWSPRFreq())
          //Serial.println(GadgetData.WSPRData.MaidenHead4);
          //Serial.println (F("Waiting for start of even minute to begin a new WSPR transmission block"));
          if ((GPSS == 0) && ((GPSM % 2) == 0))//If second is zero at even minute then start WSPR transmission
          {
            set_tx_buffer();// Encode the message in the transmit buffer

            SendWSPRBlock ();
            if (LastFreq ())
            {
              if ((GadgetData.TXPause > 60) && (Product_Model == 1017)) //More than a minute of TX delay, turn of the GPS for most of the time to save power (WSPR-TX Mini only)
              {
                PowerSaveON(); //Save power by putting the GPS to sleep and power off the Si5351 during this long TX Paus
                delay (1000UL * (GadgetData.TXPause - 10)); //Do noting until there is 10 seconds left of delay
                PowerSaveOFF();// Turn on GPS again and let the smartdelay routine gather NMEA strings for a couple of seconds
                smartdelay(2000);
              }
              else
              { //Less tha a minute of TX delay
                smartdelay(GadgetData.TXPause * 1000UL); //Pause for some time
              }
            }
            NextFreq();
            freq = freq + (100ULL * random (-100, 100)); //modify TX frequency with a random value beween -100 and +100 Hz
            smartdelay(3000);
          }
          else //Dubble-blink to indicate waiting for top of minute
          {
            SendAPIUpdate(UMesGPSLock);
            SendAPIUpdate(UMesTime);
            SendAPIUpdate(UMesLocator);
            LEDBlink();
            LEDBlink();
            smartdelay(200);
          }
        }
        if (gps.location.isValid())
        {
          //

        }
        else
        {
          //singelblink to indicate waiting for GPS Lock
          LEDBlink();
          SendAPIUpdate(UMesNoGPSLock);
          smartdelay(400);
        }
      }
    }
  }//As this routine will run for ever if not interuppted by serial port, indicate end of routine by letting DoIdle routine send status message
  DoIdle(); //Return to ideling
}


// Loop through the string, transmitting one character at a time.
void SendWSPRBlock()
{
  uint8_t i;
  unsigned long startmillis;
  unsigned long endmillis;
  boolean TXEnabled = true;

  // Send WSPR for two minutes
  digitalWrite(StatusLED, HIGH);
  if ((GadgetData.WSPRData.CallSign[0] == 'A') && (GadgetData.WSPRData.CallSign[1] == 'A') && (GadgetData.WSPRData.CallSign[2] == '0') && (GadgetData.WSPRData.CallSign[3] == 'A') && (GadgetData.WSPRData.CallSign[4] == 'A') && (GadgetData.WSPRData.CallSign[5] == 'A')) //Do not actually key the transmitter if the callsign has not been changed from the default one AA0AAA
  {
    Serial.println(F("{MIN} Callsign is not changed from the default one, Transmit is disabled"));
    Serial.println(F("{MIN} Set your Callsign to enable transmission"));
    TXEnabled = false;
  }

  startmillis = millis();
  for (i = 0; i < 162; i++)  //162 WSPR symbols to transmitt
  {
    endmillis = startmillis + ((i + 1) * (unsigned long) 683) ;   // Delay value for WSPR  delay is 683 milliseconds
    uint64_t tonefreq;
    tonefreq = freq + ((tx_buffer[i] * 146));  //~1.46 Hz  Tone spacing in centiHz
    if (TXEnabled) si5351aSetFrequency(tonefreq);
    //wait untill tone is transmitted for the correct amount of time
    while ((millis() < endmillis) && (!Serial.available())) ;//Until time is up or there is serial data received on the controll Serial port
    {
      //Do nothing, just wait
    }
    if (Serial.available()) {// If serialdata was received on Controll port then abort and handle command
      break;
    }
  }

  // Switches off Si5351a output
  si5351aOutputOff(SI_CLK0_CONTROL);
  digitalWrite(StatusLED, LOW);
  Serial.println(F("TX Off"));
}

void set_tx_buffer()
{
  // Clear out the transmit buffer
  memset(tx_buffer, 0, sizeof(tx_buffer));
  jtencode.wspr_encode(GadgetData.WSPRData.CallSign, GadgetData.WSPRData.MaidenHead4, GadgetData.WSPRData.TXPowerdBm, tx_buffer);
}


//Maidenhead code from Ossi Väänänen https://ham.stackexchange.com/questions/221/how-can-one-convert-from-lat-long-to-grid-square
void calcLocator(double lat, double lon) {
  int o1, o2, o3;
  int a1, a2, a3;
  double remainder;
  // longitude
  remainder = lon + 180.0;
  o1 = (int)(remainder / 20.0);
  remainder = remainder - (double)o1 * 20.0;
  o2 = (int)(remainder / 2.0);
  //remainder = remainder - 2.0 * (double)o2;
  //o3 = (int)(12.0 * remainder);

  // latitude
  remainder = lat + 90.0;
  a1 = (int)(remainder / 10.0);
  remainder = remainder - (double)a1 * 10.0;
  a2 = (int)(remainder);
  //remainder = remainder - (double)a2;
  //a3 = (int)(24.0 * remainder);
  GadgetData.WSPRData.MaidenHead4[0] = (char)o1 + 'A';
  GadgetData.WSPRData.MaidenHead4[1] = (char)a1 + 'A';
  GadgetData.WSPRData.MaidenHead4[2] = (char)o2 + '0';
  GadgetData.WSPRData.MaidenHead4[3] = (char)a2 + '0';
  GadgetData.WSPRData.MaidenHead4[4] = 0;
}




// This custom version of delay() ensures that the gps object
// is being "fed".
static void smartdelay(unsigned long ms)
{
  long TimeLeft;
  unsigned long EndTime = ms + millis();

  do
  {
    while (GPSSerial.available()) gps.encode(GPSSerial.read()); //If GPS data available - process it
    TimeLeft = EndTime - millis();
    if ((TimeLeft > 1000) && ((TimeLeft % 1000) < 20)) {
      //Send API update every  second
      Serial.print (F("{MPS} "));
      Serial.println (TimeLeft / 1000);
    }
  } while ((TimeLeft > 0) && (!Serial.available())) ; //Until time is up or there is serial data received
  //Serial.println (F("{MPS} 0"));
}


uint8_t i2cStart()
{
  TWCR = (1 << TWINT) | (1 << TWSTA) | (1 << TWEN);

  while (!(TWCR & (1 << TWINT))) ;

  return (TWSR & 0xF8);
}

void i2cStop()
{
  TWCR = (1 << TWINT) | (1 << TWEN) | (1 << TWSTO);

